package com.example.scheduling_meetings;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

/**
 * Варіант 2: Розробіть програму для планування зустрічей для групи користувачів.
 * Користувачі можуть вказувати свої унікальні графіки доступності для кожного дня тижня.
 * Задача полягає в тому, щоб знайти оптимальний час для зустрічі, коли всі користувачі можуть бути присутні.
 * Додаткові умови:
 * 1.	Кожен користувач має вказувати години та дні тижня, коли він доступний для зустрічі.
 * 2.	Зустріч має тривати принаймні N годин (де N - визначається користувачем).
 * 3.	Необхідно знайти найкращий час для зустрічі так, щоб всі користувачі були присутні,
 * 		і зустріч відповідала годинам доступності кожного користувача.
 * 4.	Враховуйте можливість різних часових зон користувачів, і забезпечте перетворення
 * 		відповідних часів до спільної часової зони для порівняння доступності.
 * 5.	Обчисліть найбільший спільний час для всіх користувачів, коли всі можуть бути присутні.
 */
@SpringBootApplication
public class SchedulingMeetingsApplication {

	public static void main(String[] args) {
		SpringApplication.run(SchedulingMeetingsApplication.class, args);
	}
}